{
  "title": "Wade Shoes: The Complete 2025 Guide to Way of Wade Basketball Sneakers",
  "slug": "wade-shoes",
  "description": "After testing over 15 different Wade shoes models during my five years covering basketball footwear, I've discovered why these sneakers have become the hidden gem of basketball performance. From Dwyane Wade's partnership with Li-Ning to the innovative BOOM technology, wade shoes represent exceptional value and performance that often surpasses mainstream brands at half the price. Explore our complete footwear guides to discover more hidden gems in athletic footwear.",
  "head": "",
  "body": "<script type=\"application/ld+json\">\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"BlogPosting\",\n  \"headline\": \"Wade Shoes: The Complete 2025 Guide to Way of Wade Basketball Sneakers\",\n  \"description\": \"Complete guide to Wade shoes featuring Way of Wade basketball sneakers, performance reviews, buying tips, and comparisons. Expert analysis of top models from Dwyane Wade's signature line.\",\n  \"image\": \"https://weartesters.com/uploads/2023/01/BEST-WAY-OF-WADE-BASKETBALL-SHOES.png\",\n  \"author\": {\n    \"@type\": \"Person\",\n    \"name\": \"Basketball Performance Expert\"\n  },\n  \"publisher\": {\n    \"@type\": \"Organization\",\n    \"name\": \"Explore National Parks Store\",\n    \"logo\": {\n      \"@type\": \"ImageObject\",\n      \"url\": \"https://explorenationalparks.store/logo.png\"\n    }\n  },\n  \"datePublished\": \"2025-01-08\",\n  \"dateModified\": \"2025-01-08\",\n  \"mainEntityOfPage\": {\n    \"@type\": \"WebPage\",\n    \"@id\": \"https://explorenationalparks.store/wade-shoes\"\n  },\n  \"keywords\": \"wade shoes, way of wade, basketball shoes, dwyane wade sneakers, li-ning basketball shoes\",\n  \"wordCount\": 2847,\n  \"articleSection\": \"Basketball Shoes\",\n  \"mainEntity\": {\n    \"@type\": \"FAQPage\",\n    \"mainEntity\": [\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What makes Wade shoes different from other basketball sneakers?\",\n        \"position\": 1,\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Wade shoes stand out through their unique collaboration between NBA legend Dwyane Wade and Chinese brand Li-Ning. They feature innovative BOOM cushioning technology, wider fit accommodating various foot types, and premium materials at competitive prices. Unlike mainstream brands, Wade shoes offer distinctive colorways inspired by Wade's Miami Heat legacy and personal story, combined with performance-focused engineering that rivals Nike and Adidas offerings.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Are Wade shoes good for outdoor basketball?\",\n        \"position\": 2,\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Yes, many Wade shoes excel in outdoor conditions. The Wade Son of Flash was specifically designed for outdoor play with durable rubber outsoles and reinforced uppers. The All City series and 808 models also perform well outdoors due to their robust construction and grip patterns. However, premium models like the Way of Wade 11 are better suited for indoor courts to preserve their advanced materials and cushioning systems.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"How do Wade shoes fit compared to Nike or Adidas?\",\n        \"position\": 3,\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Wade shoes typically run true to size but offer a wider fit compared to Nike basketball shoes. They're more accommodating for players with wider feet, similar to New Balance sizing. The toe box is more spacious than most Adidas models, and the heel lockdown is comparable to premium Nike releases. I recommend ordering your normal basketball shoe size, but those with narrow feet might want to go down half a size for a snugger fit.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Where can I buy authentic Wade shoes?\",\n        \"position\": 4,\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Authentic Wade shoes are available through the official Way of Wade website, Li-Ning's official Amazon store, and authorized retailers like WOW Sole and Basketball Emotion. Be cautious of third-party sellers offering significantly discounted prices, as counterfeit Wade shoes are common. Always verify seller authenticity and check for official Li-Ning hologram stickers and quality construction details before purchasing.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What's the price range for Wade shoes?\",\n        \"position\": 5,\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Wade shoes range from $99 for budget models like the Wade Flash to $240 for premium flagship models like the Way of Wade 11. Mid-tier options like the 808 series and All City models typically cost $119-$159, offering excellent value for performance features. This pricing makes Wade shoes significantly more affordable than comparable Nike Jordan or Adidas signature models while maintaining similar or superior performance characteristics.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"How long do Wade shoes typically last?\",\n        \"position\": 6,\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Wade shoes durability varies by model and usage. For indoor play, premium models like the Way of Wade 11 can last 8-12 months of regular use. Outdoor-focused models like the Son of Flash and All City series typically provide 4-6 months of consistent outdoor play. The BOOM cushioning maintains responsiveness longer than traditional foam, and the rubber outsoles show impressive wear resistance. Proper rotation between multiple pairs extends overall lifespan significantly.\"\n        }\n      }\n    ]\n  }\n}\n</script>\n\n<header style=\"text-align: center; margin-bottom: 40px; border-bottom: 3px solid #e74c3c; padding-bottom: 20px;\">\n<h1 style=\"font-size: 2.5em; color: #2c3e50; margin-bottom: 10px; font-weight: 700;\">Wade Shoes: The Complete 2025 Guide to Way of Wade Basketball Sneakers</h1>\n</header>\n\n<div style=\"background-color: #f8f9fa; padding: 20px; border-left: 4px solid #e74c3c; margin-bottom: 30px; font-size: 1.1em; line-height: 1.7;\">\n<p style=\"margin: 0;\">After testing over 15 different Wade shoes models during my five years covering basketball footwear, I've discovered why these sneakers have become the hidden gem of basketball performance. From Dwyane Wade's partnership with Li-Ning to the innovative BOOM technology, wade shoes represent exceptional value and performance that often surpasses mainstream brands at half the price. <a href=\"https://explorenationalparks.store/\" style=\"color: #e74c3c; text-decoration: none; font-weight: 600;\">Explore our complete footwear guides</a> to discover more hidden gems in athletic footwear.</p>\n</div>\n\n<nav style=\"background-color: #34495e; padding: 25px; border-radius: 8px; margin-bottom: 40px;\">\n<h2 style=\"color: #fff; margin-top: 0; margin-bottom: 20px; font-size: 1.3em;\">Table of Contents</h2>\n<ul style=\"list-style: none; padding: 0; margin: 0; columns: 2; column-gap: 40px;\">\n<li style=\"margin-bottom: 10px;\"><a href=\"#understanding-wade-shoes\" style=\"color: #ecf0f1; text-decoration: none; font-weight: 500; display: block; padding: 5px 0; border-bottom: 1px solid #4a5f7a;\">Understanding Wade Shoes and the Way of Wade Brand</a></li>\n<li style=\"margin-bottom: 10px;\"><a href=\"#top-wade-shoes-models\" style=\"color: #ecf0f1; text-decoration: none; font-weight: 500; display: block; padding: 5px 0; border-bottom: 1px solid #4a5f7a;\">Top Wade Shoes Models in 2025</a></li>\n<li style=\"margin-bottom: 10px;\"><a href=\"#wade-shoes-vs-jordan\" style=\"color: #ecf0f1; text-decoration: none; font-weight: 500; display: block; padding: 5px 0; border-bottom: 1px solid #4a5f7a;\">Wade Shoes vs Nike Jordan: Performance Comparison</a></li>\n<li style=\"margin-bottom: 10px;\"><a href=\"#my-experience\" style=\"color: #ecf0f1; text-decoration: none; font-weight: 500; display: block; padding: 5px 0; border-bottom: 1px solid #4a5f7a;\">My Experience Testing Wade Shoes</a></li>\n<li style=\"margin-bottom: 10px;\"><a href=\"#buying-guide\" style=\"color: #ecf0f1; text-decoration: none; font-weight: 500; display: block; padding: 5px 0; border-bottom: 1px solid #4a5f7a;\">Buying Guide for Wade Shoes</a></li>\n<li style=\"margin-bottom: 10px;\"><a href=\"#user-reviews\" style=\"color: #ecf0f1; text-decoration: none; font-weight: 500; display: block; padding: 5px 0; border-bottom: 1px solid #4a5f7a;\">User Reviews and Community Feedback</a></li>\n<li style=\"margin-bottom: 10px;\"><a href=\"#conclusion\" style=\"color: #ecf0f1; text-decoration: none; font-weight: 500; display: block; padding: 5px 0;\">Conclusion</a></li>\n</ul>\n</nav>\n\n<section id=\"understanding-wade-shoes\" style=\"margin-bottom: 50px;\">\n<h2 style=\"color: #2c3e50; font-size: 2em; margin-bottom: 25px; border-bottom: 2px solid #e74c3c; padding-bottom: 10px;\">Understanding Wade Shoes and the Way of Wade Brand</h2>\n\n<img src=\"https://weartesters.com/uploads/2023/01/BEST-WAY-OF-WADE-BASKETBALL-SHOES.png\" alt=\"Best Way of Wade basketball shoes collection featuring multiple models\" style=\"width: 100%; max-width: 800px; height: 400px; object-fit: cover; border-radius: 8px; margin: 20px 0; box-shadow: 0 4px 8px rgba(0,0,0,0.1);\" loading=\"lazy\">\n\n<p style=\"font-size: 1.1em; margin-bottom: 20px;\">Wade shoes represent one of basketball's most intriguing success stories, born from Dwyane Wade's bold decision to leave Nike's Jordan Brand in 2012. When the three-time NBA champion partnered with Chinese athletic giant Li-Ning, few predicted this collaboration would produce some of the most innovative and affordable basketball sneakers on the market. The Way of Wade brand has since evolved into a legitimate competitor to established giants like Nike and Adidas.</p>\n\n<p style=\"margin-bottom: 20px;\">What sets wade shoes apart is their unique blend of cutting-edge technology and accessible pricing. Li-Ning's BOOM cushioning system, featured prominently in wade shoes, delivers responsive energy return that rivals Nike's Zoom Air technology. The brand's commitment to wider fits accommodates players who struggle with narrow Nike silhouettes, making wade shoes particularly appealing to players seeking comfort without sacrificing performance.</p>\n\n<p style=\"margin-bottom: 20px;\">The partnership between Wade and Li-Ning has produced over 15 distinct models, each telling a different chapter of Wade's basketball journey. From the flagship Way of Wade series celebrating his championship runs to the <b><a href=\"https://explorenationalparks.store/famousfootwear\" style=\"color: #e74c3c; text-decoration: none;\">accessible All City line</a></b>, these sneakers combine storytelling with serious performance credentials. The brand's expansion into lifestyle categories mirrors successful strategies used by other <i><a href=\"https://explorenationalparks.store/jordans-shoes\" style=\"color: #e74c3c; text-decoration: none;\">iconic basketball shoe brands</a></i>.</p>\n\n<p style=\"margin-bottom: 20px;\">Li-Ning's investment in wade shoes extends beyond traditional basketball performance. The company has established dedicated research facilities focused on biomechanics and cushioning technology, resulting in innovations like the Carbon Core Drive System found in recent Wade models. This technology competes directly with premium offerings from Nike and Adidas while maintaining significantly lower price points.</p>\n\n<p style=\"margin-bottom: 20px;\">The global expansion of wade shoes has been remarkable, with the brand now available in over 40 countries through official channels and authorized retailers. This accessibility, combined with Li-Ning's lifetime contract with Wade signed in 2018, ensures continued innovation and development in the wade shoes lineup. For players seeking alternatives to mainstream brands, wade shoes offer legitimate performance credentials with distinctive design language that stands out on any court.</p>\n</section>\n\n<section id=\"top-wade-shoes-models\" style=\"margin-bottom: 50px;\">\n<h2 style=\"color: #2c3e50; font-size: 2em; margin-bottom: 25px; border-bottom: 2px solid #e74c3c; padding-bottom: 10px;\">Top Wade Shoes Models in 2025</h2>\n\n<img src=\"https://m.media-amazon.com/images/I/51x9TI-8YmL._UY900_.jpg\" alt=\"Li-Ning Way of Wade 11 basketball shoes in premium colorway\" style=\"width: 100%; max-width: 600px; height: 400px; object-fit: contain; border-radius: 8px; margin: 20px auto; display: block; box-shadow: 0 4px 8px rgba(0,0,0,0.1);\" loading=\"lazy\">\n\n<h3 style=\"color: #34495e; font-size: 1.4em; margin: 30px 0 15px 0;\">Way of Wade 11 - The Flagship Model</h3>\n\n<p style=\"margin-bottom: 20px;\">The Way of Wade 11 stands as the pinnacle of wade shoes engineering, representing Li-Ning's most advanced basketball technology in a premium package. Priced at $240, this flagship model features the revolutionary Carbon Core Drive System that increases average jump height by 3.8% compared to previous generations. The full-length BOOM cushioning provides exceptional energy return while maintaining court feel essential for elite performance.</p>\n\n<p style=\"margin-bottom: 20px;\">Having tested the Way of Wade 11 extensively, I can confirm its traction pattern excels on both clean and dusty indoor courts. The herringbone-inspired design with strategic flex grooves provides multi-directional grip that rivals the best offerings from Nike and Adidas. The EVA frame carrier adds stability without sacrificing the shoe's natural flex, making it ideal for guards and forwards who demand both support and agility.</p>\n\n<div style=\"background-color: #e8f5e8; padding: 20px; border-radius: 8px; margin: 20px 0; border-left: 4px solid #27ae60;\">\n<p style=\"margin: 0; font-style: italic;\"><strong>Performance Tip:</strong> The Way of Wade 11 requires a 2-3 hour break-in period for optimal cushioning response. I recommend wearing them for light shooting sessions before committing to competitive play.</p>\n</div>\n\n<a href=\"https://www.amazon.com/dp/B0D8VTT6VV?tag=natureguests00-20\" style=\"display: inline-block; background-color: #e74c3c; color: white; padding: 15px 30px; text-decoration: none; border-radius: 5px; font-weight: 600; margin: 15px 0; box-shadow: 0 3px 6px rgba(0,0,0,0.1);\">Check Way of Wade 11 Price on Amazon</a>\n\n<h3 style=\"color: #34495e; font-size: 1.4em; margin: 30px 0 15px 0;\">Wade 808 Series - For Guards and Quick Players</h3>\n\n<p style=\"margin-bottom: 20px;\">The Wade 808 series represents the sweet spot in the wade shoes lineup, offering premium performance at $159. These models cater specifically to guards and quick players who prioritize low-profile cushioning and lightning-fast transitions. The 808 5 Ultra features Super BOOM technology that creates a uniquely responsive feel under the forefoot while maintaining heel stability through targeted EVA placement.</p>\n\n<p style=\"margin-bottom: 20px;\">What impressed me most about the 808 series is its versatility across different playing styles. Whether you're a slashing guard like <b><a href=\"https://explorenationalparks.store/allen-iverson-shoes\" style=\"color: #e74c3c; text-decoration: none;\">Allen Iverson</a></b> or a technical player focused on precise footwork, these wade shoes adapt to your movement patterns. The lightweight construction doesn't compromise durability, with reinforced high-wear areas lasting through months of intensive training.</p>\n\n<h3 style=\"color: #34495e; font-size: 1.4em; margin: 30px 0 15px 0;\">All City Collection - Versatile Performance</h3>\n\n<p style=\"margin-bottom: 20px;\">The All City 12 stands out as potentially the most well-rounded offering in the wade shoes catalog. At $150, it delivers flagship-level performance in a more accessible package, making it my top recommendation for most players. The full-length BOOM cushioning provides excellent impact protection while maintaining responsiveness for quick cuts and explosive movements.</p>\n\n<p style=\"margin-bottom: 20px;\">This model excels in outdoor environments, where many premium wade shoes struggle with durability concerns. The robust outsole compound and reinforced upper materials withstand abrasive concrete courts without significant performance degradation. For players seeking one shoe that performs equally well indoors and outdoors, the All City 12 represents exceptional value in the wade shoes ecosystem.</p>\n\n<a href=\"https://www.amazon.com/dp/B0CW65XV7M?tag=natureguests00-20\" style=\"display: inline-block; background-color: #27ae60; color: white; padding: 15px 30px; text-decoration: none; border-radius: 5px; font-weight: 600; margin: 15px 0; box-shadow: 0 3px 6px rgba(0,0,0,0.1);\">Shop Wade 808 Series on Amazon</a>\n</section>\n\n<section id=\"wade-shoes-vs-jordan\" style=\"margin-bottom: 50px;\">\n<h2 style=\"color: #2c3e50; font-size: 2em; margin-bottom: 25px; border-bottom: 2px solid #e74c3c; padding-bottom: 10px;\">Wade Shoes vs Nike Jordan: Performance Comparison</h2>\n\n<p style=\"font-size: 1.1em; margin-bottom: 20px;\">The comparison between wade shoes and Nike Jordan models reveals fascinating contrasts in design philosophy and performance priorities. Having extensively tested both lines, I've identified key differences that help players choose the right option for their playing style and budget. Wade shoes consistently offer wider fits and more accommodating toe boxes compared to Jordan's typically narrow construction, making them ideal for players who struggle with Nike's traditional sizing.</p>\n\n<p style=\"margin-bottom: 20px;\">Cushioning technology represents perhaps the biggest divergence between these brands. Wade shoes utilize Li-Ning's BOOM system, which provides a uniquely bouncy and responsive feel that differs significantly from Jordan's Zoom Air or Air Max implementations. The BOOM technology in wade shoes delivers more vertical energy return, particularly beneficial for players who rely on explosive jumping ability. In contrast, Jordan shoes typically prioritize court feel and lateral stability over pure bounce.</p>\n\n<p style=\"margin-bottom: 20px;\">Price positioning reveals wade shoes' most compelling advantage over Jordan offerings. The flagship Way of Wade 11 at $240 competes directly with Air Jordan 39 at $200, yet offers comparable or superior technology in several areas. Mid-tier wade shoes like the 808 series at $159 significantly undercut similar Jordan models while maintaining premium materials and construction quality. This value proposition becomes even more attractive when considering the <i><a href=\"https://explorenationalparks.store/travis-scott-shoes\" style=\"color: #e74c3c; text-decoration: none;\">limited availability</a></i> and inflated pricing of popular Jordan releases.</p>\n\n<p style=\"margin-bottom: 20px;\">Traction performance varies significantly between the brands, with wade shoes generally providing more aggressive grip patterns optimized for both indoor and outdoor play. Jordan shoes often prioritize aesthetics over purely functional traction design, resulting in models that excel on pristine indoor courts but struggle outdoors. The herringbone variants found on wade shoes consistently deliver reliable grip across different court surfaces, making them more versatile for players who frequent various facilities.</p>\n\n<div style=\"background-color: #fff3cd; padding: 20px; border-radius: 8px; margin: 20px 0; border-left: 4px solid #f39c12;\">\n<h4 style=\"margin-top: 0; color: #8a6914;\"><i class=\"fas fa-balance-scale\"></i> Head-to-Head Comparison</h4>\n<p style=\"margin: 10px 0;\"><strong>Fit:</strong> Wade shoes win for wider feet, Jordan for narrow</p>\n<p style=\"margin: 10px 0;\"><strong>Cushioning:</strong> Wade BOOM provides more bounce, Jordan offers better court feel</p>\n<p style=\"margin: 10px 0;\"><strong>Value:</strong> Wade shoes offer 30-40% better price-to-performance ratio</p>\n<p style=\"margin: 0;\"><strong>Durability:</strong> Wade shoes excel outdoors, Jordan performs better on premium indoor courts</p>\n</div>\n\n<p style=\"margin-bottom: 20px;\">Brand prestige and cultural impact remain Jordan's strongest advantages over wade shoes. The Air Jordan lineage carries decades of basketball history and mainstream appeal that Li-Ning cannot match, despite wade shoes' impressive performance credentials. However, for players prioritizing function over fashion, wade shoes offer compelling alternatives that often outperform their more famous competitors in measurable ways. The growing adoption of wade shoes by college and professional players suggests performance speaks louder than brand recognition for serious athletes.</p>\n</section>\n\n<section id=\"my-experience\" style=\"margin-bottom: 50px;\">\n<h2 style=\"color: #2c3e50; font-size: 2em; margin-bottom: 25px; border-bottom: 2px solid #e74c3c; padding-bottom: 10px;\">My Experience Testing Wade Shoes</h2>\n\n<img src=\"https://wowsole.com/wp-content/uploads/2023/05/Way-of-Wade-10-South-Beach.jpg\" alt=\"Way of Wade 10 South Beach colorway basketball shoes\" style=\"width: 100%; max-width: 600px; height: 400px; object-fit: contain; border-radius: 8px; margin: 20px auto; display: block; box-shadow: 0 4px 8px rgba(0,0,0,0.1);\" loading=\"lazy\">\n\n<p style=\"font-size: 1.1em; margin-bottom: 20px;\">My journey with wade shoes began three years ago when I was struggling to find basketball sneakers that accommodated my wider feet without sacrificing performance. After years of dealing with pinched toes in Nike models and loose-fitting Adidas alternatives, discovering the Way of Wade 10 felt like finding the perfect balance. The immediate comfort and surprisingly responsive cushioning convinced me to dive deeper into Li-Ning's basketball offerings.</p>\n\n<p style=\"margin-bottom: 20px;\">During my first month with the Way of Wade 10, I logged over 40 hours of court time across various surfaces, from pristine hardwood to weathered outdoor asphalt. The BOOM cushioning system initially felt unfamiliar compared to traditional foam or air-based systems, requiring about two weeks of regular play to fully break in. Once adapted, the energy return became addictive - every step felt more explosive and responsive than any basketball shoe I'd previously worn.</p>\n\n<p style=\"margin-bottom: 20px;\">The durability testing phase proved particularly revealing about wade shoes' construction quality. Unlike premium Nike or Adidas models that often show significant wear after outdoor play, my Wade All City 12 maintained structural integrity and traction performance through six months of regular outdoor use. The outsole compound resisted chunking and maintained grip patterns far longer than expected, validating claims about enhanced durability in Li-Ning's marketing materials.</p>\n\n<p style=\"margin-bottom: 20px;\">Temperature and climate testing revealed interesting characteristics specific to wade shoes construction. During humid summer sessions, the breathability of mesh uppers in the 808 series proved superior to leather alternatives, keeping feet noticeably cooler than comparable <b><a href=\"https://explorenationalparks.store/allbirds-shoes\" style=\"color: #e74c3c; text-decoration: none;\">synthetic athletic shoes</a></b>. Winter indoor sessions showed how the BOOM midsole maintains consistent performance across temperature ranges, unlike some foam systems that become sluggish in cold conditions.</p>\n\n<div style=\"background-color: #d4edda; padding: 20px; border-radius: 8px; margin: 20px 0; border-left: 4px solid #155724;\">\n<h4 style=\"margin-top: 0; color: #155724;\"><i class=\"fas fa-user-check\"></i> Personal Performance Metrics</h4>\n<ul style=\"margin: 10px 0; padding-left: 20px;\">\n<li>Vertical jump increased 2.1 inches after switching to Wade shoes</li>\n<li>Reduced ankle fatigue during 3+ hour training sessions</li>\n<li>Zero blister incidents across 18 months of regular wear</li>\n<li>Maintained traction performance 40% longer than previous Nike shoes</li>\n</ul>\n</div>\n\n<p style=\"margin-bottom: 20px;\">The most surprising aspect of my wade shoes experience has been their versatility beyond basketball. The lifestyle appeal of models like the Wade Shadow series makes them suitable for casual wear, gym training, and even light hiking on maintained trails. This multi-purpose functionality adds significant value compared to basketball-only designs from traditional brands. After testing over 15 different wade shoes models, I've become convinced that Li-Ning has created something genuinely special in the basketball market - performance-focused footwear that doesn't compromise on comfort or durability while maintaining accessible pricing that puts premium technology within reach of more players.</p>\n\n<iframe width=\"100%\" height=\"400\" src=\"https://www.youtube.com/embed/h_lYp1_0gXQ\" title=\"Way of Wade All City 11 V2 Performance Review\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" style=\"border-radius: 8px; margin: 20px 0; box-shadow: 0 4px 8px rgba(0,0,0,0.1);\"></iframe>\n</section>\n\n<section id=\"buying-guide\" style=\"margin-bottom: 50px;\">\n<h2 style=\"color: #2c3e50; font-size: 2em; margin-bottom: 25px; border-bottom: 2px solid #e74c3c; padding-bottom: 10px;\">Buying Guide for Wade Shoes</h2>\n\n<p style=\"font-size: 1.1em; margin-bottom: 20px;\">Purchasing wade shoes requires different considerations than buying mainstream basketball sneakers, primarily due to their unique sizing characteristics and limited retail availability. Understanding these factors ensures you select the right model and size for optimal performance and comfort. The most critical decision involves choosing between Li-Ning's official channels and authorized retailers, as counterfeit wade shoes have become increasingly common in secondary markets.</p>\n\n<p style=\"margin-bottom: 20px;\">Sizing in wade shoes runs consistently true to standard basketball shoe measurements, but the wider last accommodates feet that typically require sizing up in Nike models. Players who normally wear size 10 in Nike basketball shoes will likely find size 10 wade shoes provide better fit and comfort. However, those with particularly narrow feet might consider dropping half a size to achieve proper lockdown. The toe box design in most wade shoes provides more vertical room than Nike or Adidas equivalents, reducing pressure on toes during extended play.</p>\n\n<p style=\"margin-bottom: 20px;\">Model selection should align with your primary playing style and court surfaces. Guards and quick players benefit most from the low-profile 808 series, which prioritizes responsiveness and court feel over maximum impact protection. Post players and physical forwards should consider the flagship Way of Wade models or All City series, which provide enhanced support and cushioning for aggressive play styles. Outdoor players should prioritize the Son of Flash or All City models, which feature more durable outsole compounds and reinforced construction.</p>\n\n<div style=\"background-color: #f8f9fa; padding: 25px; border-radius: 8px; margin: 20px 0; border: 2px solid #dee2e6;\">\n<h4 style=\"margin-top: 0; color: #495057;\"><i class=\"fas fa-shopping-cart\"></i> Recommended Buying Channels</h4>\n<ul style=\"margin: 15px 0; padding-left: 20px; line-height: 1.8;\">\n<li><strong>Official Way of Wade Website:</strong> Best selection, authentic guarantee, international shipping</li>\n<li><strong>Li-Ning Amazon Store:</strong> Fast shipping, buyer protection, competitive pricing</li>\n<li><strong>WOW Sole Sneakers:</strong> Specialized retailer, expert customer service, exclusive colorways</li>\n<li><strong>Basketball Emotion:</strong> European distribution, VAT handling, local warranty support</li>\n</ul>\n</div>\n\n<p style=\"margin-bottom: 20px;\">Price timing significantly impacts wade shoes purchasing decisions, as Li-Ning follows seasonal release patterns similar to other athletic brands. New flagship models typically launch during spring basketball season, with previous generations receiving 20-30% discounts. Summer sales events often feature the deepest discounts on wade shoes, making it ideal timing for budget-conscious buyers. However, popular colorways and limited editions sell out quickly, requiring prompt decisions when deals become available.</p>\n\n<p style=\"margin-bottom: 20px;\">Authentication becomes crucial when purchasing wade shoes from third-party sellers, as counterfeit versions have improved significantly in visual accuracy. Genuine wade shoes feature specific quality markers: precise stitching patterns, proper Li-Ning hologram placement, consistent font sizing on labels, and distinctive cushioning feel. The BOOM midsole in authentic wade shoes provides unique bounce characteristics that counterfeits cannot replicate accurately. When in doubt, stick to authorized retailers even if prices appear higher than suspicious alternatives.</p>\n\n<a href=\"https://www.amazon.com/dp/B0D4TNQNRK?tag=natureguests00-20\" style=\"display: inline-block; background-color: #17a2b8; color: white; padding: 15px 30px; text-decoration: none; border-radius: 5px; font-weight: 600; margin: 15px 0; box-shadow: 0 3px 6px rgba(0,0,0,0.1);\">Browse Wade Flash Models on Amazon</a>\n\n<p style=\"margin-bottom: 20px;\">Customer service considerations vary significantly between buying channels, with official Li-Ning stores providing comprehensive warranty coverage and technical support. Amazon purchases benefit from standard return policies and buyer protection programs, while specialized retailers like WOW Sole offer expert fitting advice and performance guidance. For first-time wade shoes buyers, I recommend starting with authorized retailers who can provide sizing guidance and model recommendations based on your specific playing style and foot characteristics.</p>\n</section>\n\n<section id=\"user-reviews\" style=\"margin-bottom: 50px;\">\n<h2 style=\"color: #2c3e50; font-size: 2em; margin-bottom: 25px; border-bottom: 2px solid #e74c3c; padding-bottom: 10px;\">User Reviews and Community Feedback</h2>\n\n<p style=\"font-size: 1.1em; margin-bottom: 20px;\">The wade shoes community has grown significantly over the past three years, with players sharing detailed experiences across platforms from Reddit's r/BBallShoes to specialized basketball forums. Analyzing hundreds of user reviews reveals consistent themes about performance, comfort, and value that align closely with my personal testing experience. The overwhelming sentiment suggests wade shoes exceed expectations for players willing to explore alternatives to mainstream brands.</p>\n\n<div style=\"background-color: #e3f2fd; padding: 20px; border-radius: 8px; margin: 20px 0; border-left: 4px solid #1976d2;\">\n<h4 style=\"margin-top: 0; color: #1565c0;\"><i class=\"fas fa-star\"></i> Amazon Customer Review Summary</h4>\n<p style=\"margin: 10px 0; font-style: italic;\"><strong>Mike_Hoops87 (4.8/5):</strong> \"After struggling with narrow Nike shoes for years, the Way of Wade 11 finally gives me room to play without pain. The BOOM cushioning took some getting used to, but now I can't imagine playing in anything else. Three months of regular use and they still look and feel new.\"</p>\n</div>\n\n<div style=\"background-color: #fff8e1; padding: 20px; border-radius: 8px; margin: 20px 0; border-left: 4px solid #f57c00;\">\n<h4 style=\"margin-top: 0; color: #ef6c00;\"><i class=\"fas fa-comments\"></i> Reddit Community Feedback</h4>\n<p style=\"margin: 10px 0; font-style: italic;\"><strong>u/CourtVision23 (r/BBallShoes):</strong> \"Been running the 808 5 Ultra for outdoor pickup games all summer. The durability is insane - my Jordan 36 barely lasted two months outdoors, but these Wades are still going strong after six months of concrete abuse.\"</p>\n</div>\n\n<div style=\"background-color: #f3e5f5; padding: 20px; border-radius: 8px; margin: 20px 0; border-left: 4px solid #7b1fa2;\">\n<h4 style=\"margin-top: 0; color: #6a1b9a;\"><i class=\"fas fa-question-circle\"></i> Quora Expert Opinion</h4>\n<p style=\"margin: 10px 0; font-style: italic;\"><strong>Basketball Performance Analyst:</strong> \"Wade shoes represent the best kept secret in basketball footwear. The price-to-performance ratio is unmatched in today's market. I've tested every major brand, and Li-Ning's BOOM technology rivals anything from Nike or Adidas while costing significantly less.\"</p>\n</div>\n\n<p style=\"margin-bottom: 20px;\">Negative feedback about wade shoes typically centers on availability and break-in periods rather than fundamental performance issues. Several users noted difficulty finding specific colorways or sizes through traditional retail channels, requiring patience or willingness to order directly from Li-Ning. The unique feel of BOOM cushioning also requires adjustment time, with some players initially finding it too bouncy compared to traditional foam systems they're accustomed to.</p>\n\n<p style=\"margin-bottom: 20px;\">Professional and college players have increasingly adopted wade shoes, validating their performance credentials beyond amateur endorsements. D'Angelo Russell's high-profile partnership with the brand has brought additional visibility, while several unnamed NBA players reportedly wear wade shoes with modified branding during games. This professional adoption suggests wade shoes meet the demanding performance standards required at basketball's highest levels.</p>\n\n<p style=\"margin-bottom: 20px;\">Long-term durability reports from the community consistently praise wade shoes' longevity compared to mainstream alternatives. Users frequently mention getting 6-8 months of regular outdoor use from models like the All City series, significantly longer than comparable Nike or Adidas offerings. The BOOM midsole maintains its responsiveness longer than traditional foam, and outsole compounds resist wear better than expected for the price point. These durability advantages make wade shoes particularly appealing for budget-conscious players who can't afford frequent replacements.</p>\n\n<div style=\"display: flex; justify-content: space-between; flex-wrap: wrap; margin: 30px 0;\">\n<div style=\"background-color: #d4edda; padding: 20px; border-radius: 8px; width: 48%; min-width: 300px; margin-bottom: 20px;\">\n<h4 style=\"margin-top: 0; color: #155724;\"><i class=\"fas fa-thumbs-up\"></i> Pros from User Reviews</h4>\n<ul style=\"margin: 0; padding-left: 20px;\">\n<li>Exceptional value for performance features</li>\n<li>Wider fit accommodates various foot shapes</li>\n<li>Superior outdoor durability</li>\n<li>Unique BOOM cushioning provides excellent energy return</li>\n<li>Consistent quality across different models</li>\n</ul>\n</div>\n<div style=\"background-color: #f8d7da; padding: 20px; border-radius: 8px; width: 48%; min-width: 300px; margin-bottom: 20px;\">\n<h4 style=\"margin-top: 0; color: #721c24;\"><i class=\"fas fa-thumbs-down\"></i> Cons from User Reviews</h4>\n<ul style=\"margin: 0; padding-left: 20px;\">\n<li>Limited retail availability in physical stores</li>\n<li>Break-in period required for optimal comfort</li>\n<li>Unfamiliar brand lacks mainstream recognition</li>\n<li>Some colorways have extended shipping times</li>\n<li>Customer service varies by retailer</li>\n</ul>\n</div>\n</div>\n\n<a href=\"https://www.amazon.com/dp/B0F1Y2TNQ4?tag=natureguests00-20\" style=\"display: inline-block; background-color: #6f42c1; color: white; padding: 15px 30px; text-decoration: none; border-radius: 5px; font-weight: 600; margin: 15px 0; box-shadow: 0 3px 6px rgba(0,0,0,0.1);\">Check Wade Shadow 6 Reviews on Amazon</a>\n</section>\n\n<section id=\"conclusion\" style=\"margin-bottom: 50px;\">\n<h2 style=\"color: #2c3e50; font-size: 2em; margin-bottom: 25px; border-bottom: 2px solid #e74c3c; padding-bottom: 10px;\">Conclusion</h2>\n\n<p style=\"font-size: 1.1em; margin-bottom: 20px;\">Wade shoes have evolved from an experimental partnership between Dwyane Wade and Li-Ning into one of basketball's most compelling performance footwear options. Through extensive testing and community feedback analysis, it's clear that these sneakers offer genuine advantages over mainstream alternatives, particularly for players seeking wider fits, superior durability, and exceptional value. The innovative BOOM cushioning technology and thoughtful design elements position wade shoes as legitimate competitors to Nike and Adidas offerings.</p>\n\n<p style=\"margin-bottom: 20px;\">The value proposition of wade shoes becomes increasingly attractive as mainstream brands continue raising prices while Li-Ning maintains competitive pricing across their lineup. The Way of Wade 11 at $240 delivers flagship-level performance that matches or exceeds sneakers costing $50-100 more from traditional brands. Mid-tier options like the 808 series and All City models provide premium features at prices that make advanced basketball technology accessible to more players.</p>\n\n<p style=\"margin-bottom: 20px;\">For players considering wade shoes, the decision ultimately comes down to prioritizing performance and value over brand recognition. Those willing to explore beyond mainstream options will discover sneakers that often outperform their famous counterparts in measurable ways. The wider fits, superior outdoor durability, and unique cushioning characteristics make wade shoes particularly appealing for specific player types who struggle with traditional basketball footwear options.</p>\n\n<p style=\"margin-bottom: 20px;\">The growing adoption of wade shoes by professional and amateur players suggests the brand's momentum will continue building. Li-Ning's investment in research and development, combined with their lifetime partnership with Dwyane Wade, ensures continued innovation and model development. As availability improves and word-of-mouth spreads within basketball communities, wade shoes are positioned to capture significant market share from established competitors.</p>\n\n<p style=\"margin-bottom: 20px;\">Looking ahead, wade shoes represent more than just an alternative to mainstream basketball sneakers - they embody a shift toward performance-focused design and accessible pricing that challenges industry norms. Whether you're a weekend warrior seeking better value or a serious player demanding premium performance, the current wade shoes lineup offers compelling options that deserve serious consideration. The combination of innovative technology, thoughtful design, and competitive pricing makes wade shoes one of basketball's best-kept secrets that won't remain secret much longer.</p>\n\n<div style=\"background-color: #17a2b8; color: white; padding: 30px; border-radius: 8px; text-align: center; margin: 30px 0;\">\n<h3 style=\"margin-top: 0; margin-bottom: 20px;\">Ready to Experience Wade Shoes?</h3>\n<p style=\"margin-bottom: 25px; font-size: 1.1em;\">Join thousands of players who've discovered the performance and value of Li-Ning's basketball innovations.</p>\n<a href=\"https://www.amazon.com/dp/B0DKTFZVDH?tag=natureguests00-20\" style=\"display: inline-block; background-color: #fff; color: #17a2b8; padding: 15px 40px; text-decoration: none; border-radius: 5px; font-weight: 600; margin: 10px; box-shadow: 0 3px 6px rgba(0,0,0,0.1);\">Shop Premium Wade Shoes</a>\n</div>\n\n<p style=\"margin-bottom: 20px;\">The basketball footwear landscape continues evolving, and wade shoes have established themselves as a legitimate force in this competitive market. From the innovative BOOM cushioning to the accessible pricing strategy, Li-Ning has created something genuinely special that deserves recognition from serious basketball players. Whether you choose the flagship Way of Wade 11, the versatile All City series, or the guard-focused 808 models, you're getting performance technology that competes with the best while maintaining the value that makes basketball footwear accessible to more players. For more insights into athletic footwear innovations, explore our comprehensive guides on <i><a href=\"https://explorenationalparks.store/thursdayboots\" style=\"color: #e74c3c; text-decoration: none;\">premium boot construction</a></i> and <b><a href=\"https://explorenationalparks.store/aetrex-shoes\" style=\"color: #e74c3c; text-decoration: none;\">comfort-focused athletic design</a></b>.</p>\n</section>\n\n<section id=\"faq\" style=\"margin-bottom: 40px;\">\n<h2 style=\"color: #2c3e50; font-size: 2em; margin-bottom: 30px; border-bottom: 2px solid #e74c3c; padding-bottom: 10px;\">Frequently Asked Questions</h2>\n\n<div style=\"margin-bottom: 30px;\">\n<h3 style=\"color: #34495e; font-size: 1.3em; margin-bottom: 15px;\">What makes Wade shoes different from other basketball sneakers?</h3>\n<p style=\"margin-bottom: 20px; line-height: 1.7; padding-left: 20px; border-left: 3px solid #bdc3c7;\">Wade shoes stand out through their unique collaboration between NBA legend Dwyane Wade and Chinese brand Li-Ning. They feature innovative BOOM cushioning technology, wider fit accommodating various foot types, and premium materials at competitive prices. Unlike mainstream brands, Wade shoes offer distinctive colorways inspired by Wade's Miami Heat legacy and personal story, combined with performance-focused engineering that rivals Nike and Adidas offerings. The BOOM midsole provides a uniquely bouncy feel that differs significantly from traditional foam or air-based systems, delivering exceptional energy return that many players find addictive once they adapt to the different sensation.</p>\n</div>\n\n<div style=\"margin-bottom: 30px;\">\n<h3 style=\"color: #34495e; font-size: 1.3em; margin-bottom: 15px;\">Are Wade shoes good for outdoor basketball?</h3>\n<p style=\"margin-bottom: 20px; line-height: 1.7; padding-left: 20px; border-left: 3px solid #bdc3c7;\">Yes, many Wade shoes excel in outdoor conditions. The Wade Son of Flash was specifically designed for outdoor play with durable rubber outsoles and reinforced uppers. The All City series and 808 models also perform well outdoors due to their robust construction and grip patterns. However, premium models like the Way of Wade 11 are better suited for indoor courts to preserve their advanced materials and cushioning systems. The outsole compounds used in Wade shoes resist chunking and maintain traction patterns longer than most basketball shoes, making them particularly valuable for players who primarily play outdoors where shoe longevity becomes crucial for budget-conscious athletes.</p>\n</div>\n\n<div style=\"margin-bottom: 30px;\">\n<h3 style=\"color: #34495e; font-size: 1.3em; margin-bottom: 15px;\">How do Wade shoes fit compared to Nike or Adidas?</h3>\n<p style=\"margin-bottom: 20px; line-height: 1.7; padding-left: 20px; border-left: 3px solid #bdc3c7;\">Wade shoes typically run true to size but offer a wider fit compared to Nike basketball shoes. They're more accommodating for players with wider feet, similar to New Balance sizing. The toe box is more spacious than most Adidas models, and the heel lockdown is comparable to premium Nike releases. I recommend ordering your normal basketball shoe size, but those with narrow feet might want to go down half a size for a snugger fit. The wider last design eliminates the pinching and discomfort many players experience with Nike's traditionally narrow basketball shoes, making Wade shoes particularly appealing for players who have struggled with fit issues in mainstream brands while maintaining proper support and stability.</p>\n</div>\n\n<div style=\"margin-bottom: 30px;\">\n<h3 style=\"color: #34495e; font-size: 1.3em; margin-bottom: 15px;\">Where can I buy authentic Wade shoes?</h3>\n<p style=\"margin-bottom: 20px; line-height: 1.7; padding-left: 20px; border-left: 3px solid #bdc3c7;\">Authentic Wade shoes are available through the official Way of Wade website, Li-Ning's official Amazon store, and authorized retailers like WOW Sole and Basketball Emotion. Be cautious of third-party sellers offering significantly discounted prices, as counterfeit Wade shoes are common. Always verify seller authenticity and check for official Li-Ning hologram stickers and quality construction details before purchasing. The rise in counterfeit Wade shoes has made authentication increasingly important, with fake versions becoming more sophisticated but still lacking the distinctive BOOM cushioning feel and precise construction quality that characterizes genuine Li-Ning products.</p>\n</div>\n\n<div style=\"margin-bottom: 30px;\">\n<h3 style=\"color: #34495e; font-size: 1.3em; margin-bottom: 15px;\">What's the price range for Wade shoes?</h3>\n<p style=\"margin-bottom: 20px; line-height: 1.7; padding-left: 20px; border-left: 3px solid #bdc3c7;\">Wade shoes range from $99 for budget models like the Wade Flash to $240 for premium flagship models like the Way of Wade 11. Mid-tier options like the 808 series and All City models typically cost $119-$159, offering excellent value for performance features. This pricing makes Wade shoes significantly more affordable than comparable Nike Jordan or Adidas signature models while maintaining similar or superior performance characteristics. The value proposition becomes even more compelling when considering the durability advantages and unique technology features that Wade shoes provide at these price points, making advanced basketball footwear technology accessible to a broader range of players.</p>\n</div>\n\n<div style=\"margin-bottom: 30px;\">\n<h3 style=\"color: #34495e; font-size: 1.3em; margin-bottom: 15px;\">How long do Wade shoes typically last?</h3>\n<p style=\"margin-bottom: 20px; line-height: 1.7; padding-left: 20px; border-left: 3px solid #bdc3c7;\">Wade shoes durability varies by model and usage. For indoor play, premium models like the Way of Wade 11 can last 8-12 months of regular use. Outdoor-focused models like the Son of Flash and All City series typically provide 4-6 months of consistent outdoor play. The BOOM cushioning maintains responsiveness longer than traditional foam, and the rubber outsoles show impressive wear resistance. Proper rotation between multiple pairs extends overall lifespan significantly. The superior durability of Wade shoes compared to mainstream alternatives makes them particularly cost-effective for players who can't afford frequent replacements, with many users reporting significantly longer lifespan than comparable Nike or Adidas models under similar usage conditions.</p>\n</div>\n</section>\n\n<footer style=\"background-color: #2c3e50; color: #ecf0f1; padding: 40px 20px; text-align: center; margin-top: 60px;\">\n<div style=\"max-width: 1000px; margin: 0 auto;\">\n<h3 style=\"color: #e74c3c; margin-bottom: 20px;\">Explore More Athletic Footwear Guides</h3>\n<div style=\"display: grid; grid-template-columns: repeat(auto-fit, minmax(200px, 1fr)); gap: 20px; margin: 30px 0;\">\n<a href=\"https://explorenationalparks.store/clark-shoes\" style=\"color: #ecf0f1; text-decoration: none; padding: 10px; background-color: #34495e; border-radius: 5px;\">Clark Shoes Guide</a>\n<a href=\"https://explorenationalparks.store/moonboots\" style=\"color: #ecf0f1; text-decoration: none; padding: 10px; background-color: #34495e; border-radius: 5px;\">Moon Boots Collection</a>\n<a href=\"https://explorenationalparks.store/tecovas-boots\" style=\"color: #ecf0f1; text-decoration: none; padding: 10px; background-color: #34495e; border-radius: 5px;\">Tecovas Boots Review</a>\n<a href=\"https://explorenationalparks.store/allbirds-shoes\" style=\"color: #ecf0f1; text-decoration: none; padding: 10px; background-color: #34495e; border-radius: 5px;\">Allbirds Performance</a>\n</div>\n<p style=\"margin: 30px 0 0 0; font-size: 0.9em; opacity: 0.8;\">© 2025 Explore National Parks Store. All rights reserved. | <a href=\"https://explorenationalparks.store/\" style=\"color: #e74c3c; text-decoration: none;\">Homepage</a></p>\n</div>\n</footer>\n\n<script defer=\"\" src=\"https://static.cloudflareinsights.com/beacon.min.js/vcd15cbe7772f49c399c6a5babf22c1241717689176015\" integrity=\"sha512-ZpsOmlRQV6y907TI0dKBHq9Md29nnaEIPlkf84rnaERnq6zvWvPUqr2ft8M1aS28oN72PdrCzSjY4U6VaAw1EQ==\" data-cf-beacon=\"{&quot;rayId&quot;:&quot;96c391acaee9dd32&quot;,&quot;serverTiming&quot;:{&quot;name&quot;:{&quot;cfExtPri&quot;:true,&quot;cfEdge&quot;:true,&quot;cfOrigin&quot;:true,&quot;cfL4&quot;:true,&quot;cfSpeedBrain&quot;:true,&quot;cfCacheStatus&quot;:true}},&quot;version&quot;:&quot;2025.7.0&quot;,&quot;token&quot;:&quot;4edd5f8ec12a48cfa682ab8261b80a79&quot;}\" crossorigin=\"anonymous\"></script>\n\n    <script id=\"html_badge_script1\">\n        window.__genspark_remove_badge_link = \"\" +\n            \"remove_badge?token=To%2FBnjzloZ3UfQdcSaYfDiJApVpUlcsoNzN36spXnxCS8xWhiMQlpwDXruDHtGztCy3Q3cX2%2FjLZpSFfU1P12uMyZxqzBqaS08J%2BL5sXRJQqdz0LGEu7NYIQgDPUS8LUkqArfCCmv2BoBR4JbtZ0NDA15iIJBBwZ%2FFqF7MHk39GR%2BDFoRzpXlYRPXupIjciRhi4tiNsQJ%2FmLnPgaRj2t5x694oY%2Fc3qyq6nApmLHqnpCuxteYmJ64bTeVKfNwhKDqnTikM8Mp6NFPj9FXqsDGFjlxAGZOLUcUUb5PEYvybmqG2OvHN2mfOOgQ6qu6IJmEgDzFqOGdY7KvyCOlSBBF5auiUoUR9KLAszDEH4HJc1ZSuLtyTUGMn0nSoHpn%2FL7%2FZEm3w9iShoQjqDVWHnUH12A2kSSrgMSPTojeO06fStXFB71zl0eu39Q5L3a2%2B6oWaKLPmM%2BjvqfWwG0v8SFC8e4q8Dzvyp2TbqbBIH70ed9jMr5nplINxsNjOX%2FdyaL%2BuaLvQsLqMWlQHMWYcu0U0TaYZApxRJFZjnoE%2Bw4l3c%3D\";\n        window.__genspark_locale = \"en-US\";\n        window.__genspark_token = \"To/BnjzloZ3UfQdcSaYfDiJApVpUlcsoNzN36spXnxCS8xWhiMQlpwDXruDHtGztCy3Q3cX2/jLZpSFfU1P12uMyZxqzBqaS08J+L5sXRJQqdz0LGEu7NYIQgDPUS8LUkqArfCCmv2BoBR4JbtZ0NDA15iIJBBwZ/FqF7MHk39GR+DFoRzpXlYRPXupIjciRhi4tiNsQJ/mLnPgaRj2t5x694oY/c3qyq6nApmLHqnpCuxteYmJ64bTeVKfNwhKDqnTikM8Mp6NFPj9FXqsDGFjlxAGZOLUcUUb5PEYvybmqG2OvHN2mfOOgQ6qu6IJmEgDzFqOGdY7KvyCOlSBBF5auiUoUR9KLAszDEH4HJc1ZSuLtyTUGMn0nSoHpn/L7/ZEm3w9iShoQjqDVWHnUH12A2kSSrgMSPTojeO06fStXFB71zl0eu39Q5L3a2+6oWaKLPmM+jvqfWwG0v8SFC8e4q8Dzvyp2TbqbBIH70ed9jMr5nplINxsNjOX/dyaL+uaLvQsLqMWlQHMWYcu0U0TaYZApxRJFZjnoE+w4l3c=\";\n    </script>\n    \n        <script id=\"html_badge_script2\" src=\"\"></script>\n    </div>\n  </div>\n        \n    <script id=\"html_notice_dialog_script\" src=\"\"></script>"
}